Revit 2024 API
Rebar.GetShapeDrivenAccessor Method
 Returns an interface providing access to shape-driven properties and methods for this Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public RebarShapeDrivenAccessor GetShapeDrivenAccessor()
Visual Basic
Public Function GetShapeDrivenAccessor As RebarShapeDrivenAccessor
Visual C++
public:
RebarShapeDrivenAccessor^ GetShapeDrivenAccessor()
Return Value
 The interface providing access to shape-driven properties and methods for this Rebar element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace